from textwrap import dedent

from . import en

language = "fa"


class Messages(en.Messages):
    command_start = "شروع و دیدن دستورها"
    command_help = "کمک در استفاده از ربات"
    command_my_link = "دریافت پیام ناشناس"
    command_new_link = "دریافت لینک ناشناس جدید"
    command_delete_link = "حذف لینک ناشناس"
    command_cancel = "هر کار دارم میکنم، کنسلش کن!"

    start_message = dedent(
        """\
        *دریافت پیام ناشناس*
        روی /my\\_link کلیک کن، کد یا لینک ناشناست رو بگیر و بده به بقیه!

        هر وقت خسته شدی میتونی با /delete\\_link لینکت رو پاک کنی یا با /new\\_link یه لینک جدید بگیری.

        *راهنما*
        روی /help بزن تا یه سری نکته کمکی بگیری.
    """
    )

    help_message = (
        "*ادمین ربات پیام‌های من رو می‌بینه؟*" + "\n"
        "نه. همه چیز ناشناس و کد این ربات هم متن بازه. می‌تونین کد ربات رو اینجا ببینین:"
        + "\n"
        "[کد در گیت‌هاب](https://github.com/Ali-Toosi/eastern-bots/tree/main/eastern_bots/opanonbot) "
        "\n\n"
        "*چطوری یکی رو آنبلاک کنم؟*" + "\n"
        "متاسفانه وقتی یکی رو بلاک کنی دیگه نمی‌تونی آنبلاکش کنی."
        "\n\n"
        "*میشه به ربات امکانات اضافه کرد؟*" + "\n"
        "بله میشه. این ربات اوپن‌سورس هست و اگه برنامه‌نویسی بلدین "
        "و می‌خواین امکانی به ربات اضافه کنین خیلی استقبال میشه."
        "\nhttps://github.com/Ali-Toosi/eastern-bots"
    )

    all_cancelled = "کنسل شد! حالا چی؟ 👈 /start؟"

    show_link = dedent(
        """\
        هر کسی این لینک رو داشته باشه می‌تونه بهت پیام بده مگه اینکه بلاک باشه.

        می‌تونی لینکت رو با /delete\\_link پاک کنی یا با /new\\_link یه لینک جدید بگیری.

        👇 لینک ناشناس شما 👇
    """
    )

    delete_link_no_link = (
        "لینک ناشناسی برای پاک کردن نداری. میتونی با "
        + "/my_link"
        + " یه لینک ناشناس برای خودت بگیری"
    )
    delete_link_confirmation = (
        "مطمئنی می‌خوای لینکت رو پاک کنی؟ هیچ کس دیگه نمیتونه با این لینک بهت پیام بده"
    )
    delete_link_deleted = (
        "لینک ناشناست پاک شد! اگر خواستی می‌تونی با "
        + "/my_link"
        + " یه لینک جدید بگیری."
    )
    delete_link_cancelled = "حله."

    new_link_confirmation = dedent(
        """\
        درست کردن لینک جدید، لینک قبلیت رو حذف می‌کنه و دیگه ازش پیامی نمی‌گیری.

        مطمئنی می‌خوای لینک جدید درست کنی؟
    """
    )
    new_link_created = "اینم لینک جدیدت:"

    send_link_not_found = "این لینک وجود نداره."
    send_blocked = "متاسفانه بلاک شدی و نمی‌تونی به این آدم پیام بدی 😞"
    send_ask_message = "پیام ناشناست رو بفرست تا بفرستم..." + " (یا /cancel)"
    send_successful = "فرستادم براش! هر وقت جواب بده بهت خبر میدم"
    send_failed = (
        "پیامت ارسال نشد! با یه پیام دیگه امتحان کن. اگه بازم ارسال نشد یعنی احتمالا دیگه از این ربات استفاده نمیکنه"
        " و نمی‌تونه پیامی دریافت کنه."
    )

    no_self_messaging = "نمیشه به خودت پیام بفرستی! اونطوری خیلی ناشناس نمی‌مونی."
    new_anonymous_chat = "چت ناشناس حدید!"

    block_confirmation = "مطمئنی می‌خوای بلاک کنی؟ دیگه هیچ پیامی ازش نمی‌گیری!"
    user_blocked = "بلاک شد! تمام!"
    block_cancelled = "ردیفه. بلاک نمی‌کنم : )"

    unknown_message = "نمی‌دونم این پیام چیه 🤷‍♀️"
    confirmation_keyboard_ignored = "نفهمیدم! بی‌زحمت از کیبورد استفاده کن:"

    yes_delete = "آره پاک کن"
    no_cancel = "نه! لغو"
    yes_do_it = "آره!"
    yes_block = "قطعا بلاک!"
